phidiawang/Wisemay_CoolingFang_V2.0/src/S12ZVM_system/startup_CW/mc9s12zvml32.c
/* * * * *  32-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile PARTIDSTR _PARTID;                                /* Part ID Register; 0x00000000 */
volatile ADC0CMDSTR _ADC0CMD;                              /* ADC0 Command Register; 0x00000614 */
volatile ADC1CMDSTR _ADC1CMD;                              /* ADC1 Command Register; 0x00000654 */


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
volatile void* volatile MMCPC;                             /* Captured S12ZCPU Program Counter Low; 0x00000087 */
volatile void* volatile DBGAA;                             /* Debug Comparator A Address Register Low; 0x00000117 */
volatile void* volatile DBGBA;                             /* Debug Comparator B Address Register Low; 0x00000127 */
volatile void* volatile DBGCA;                             /* Debug Comparator C Address Register Low; 0x00000137 */
volatile void* volatile DBGDA;                             /* Debug Comparator D Address Register Low; 0x00000147 */
volatile void* volatile ECCDPTR;                           /* ECC Debug Pointer Register Low; 0x000003C9 */
volatile void* volatile PTUPTR;                            /* PTU Pointer Register; 0x00000593 */
volatile void* volatile ADC0CBP;                           /* ADC0 Command Base Pointer Register 0; 0x00000593 */
volatile void* volatile ADC0RBP;                           /* ADC0 Result Base Pointer Register 0; 0x00000593 */
volatile void* volatile ADC1CBP;                           /* ADC1 Command Base Pointer Register 0; 0x00000593 */
volatile void* volatile ADC1RBP;                           /* ADC1 Result Base Pointer Register 0; 0x00000593 */



/*lint -restore */

/* EOF */
